---
kind: enumMember
id: F:Autodesk.Revit.DB.DetachFromCentralOption.DetachAndDiscardWorksets
enum: Autodesk.Revit.DB.DetachFromCentralOption
source: html/4f5d4de3-7c57-890a-e158-329ae1be884b.htm
---
# Autodesk.Revit.DB.DetachFromCentralOption.DetachAndDiscardWorksets

Detach the model being opened from its central model and discard worksets/worksharing.